/*
 * 时    间：2020年3月7日18:06:15
 * 题    目：76.求出0-1000中能被7整除的数，并计算输出每五个数的和。
 * 知 识 点：
 * 操作步骤：
 */
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace CSharp基础练习题_76
{
    class Program
    {
        static void Main(string[] args) {
            int i = 0;
            int j = 0;
            int sum = 0;
            int k = 0;
            for (i = 0; i <= 1000; i++)
            {
                if (i % 7 == 0)
                {
                    Console.Write(" {0,-3}  ", i);
                    sum += i;
                    ++j;
                    if (j >= 5)
                    {
                        j = 0;
                        Console.WriteLine(" |   Sum{0,-2} = {1,-4}  ", k, sum);
                        sum = 0;
                        k++;
                    }
                }
            }
            Console.ReadKey();
        }
    }
}
/*
 0     7     14    21    28    |   Sum0  = 70
 35    42    49    56    63    |   Sum1  = 245
 70    77    84    91    98    |   Sum2  = 420
 105   112   119   126   133   |   Sum3  = 595
 140   147   154   161   168   |   Sum4  = 770
 175   182   189   196   203   |   Sum5  = 945
 210   217   224   231   238   |   Sum6  = 1120
 245   252   259   266   273   |   Sum7  = 1295
 280   287   294   301   308   |   Sum8  = 1470
 315   322   329   336   343   |   Sum9  = 1645
 350   357   364   371   378   |   Sum10 = 1820
 385   392   399   406   413   |   Sum11 = 1995
 420   427   434   441   448   |   Sum12 = 2170
 455   462   469   476   483   |   Sum13 = 2345
 490   497   504   511   518   |   Sum14 = 2520
 525   532   539   546   553   |   Sum15 = 2695
 560   567   574   581   588   |   Sum16 = 2870
 595   602   609   616   623   |   Sum17 = 3045
 630   637   644   651   658   |   Sum18 = 3220
 665   672   679   686   693   |   Sum19 = 3395
 700   707   714   721   728   |   Sum20 = 3570
 735   742   749   756   763   |   Sum21 = 3745
 770   777   784   791   798   |   Sum22 = 3920
 805   812   819   826   833   |   Sum23 = 4095
 840   847   854   861   868   |   Sum24 = 4270
 875   882   889   896   903   |   Sum25 = 4445
 910   917   924   931   938   |   Sum26 = 4620
 945   952   959   966   973   |   Sum27 = 4795
 980   987   994
 */